import "./sosal.css";
import SubImg from "../../assets/img/price.svg";

function sosal() {
  return (
    <>
      <div className="main-sosal">
        <div className="h1-perms">
          <h1>НАШИ ПРЕИМУЩЕСТВА</h1>
          <div className="our-perms-img">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="48"
              height="49"
              viewBox="0 0 48 49"
              fill="none"
            >
              <g clip-path="url(#clip0_309_277)">
                <path
                  d="M14.7445 9.84661C14.2178 9.40078 14.0265 8.67481 14.2652 8.02776C14.5019 7.3807 15.1174 6.95065 15.8078 6.95065H20.7416L22.4875 2.05237C22.7262 1.40926 23.3417 0.983154 24.0282 0.983154C24.7147 0.983154 25.3302 1.40926 25.5689 2.05237L27.3147 6.95065H32.2485C32.939 6.95065 33.5564 7.38268 33.7932 8.0317C34.0299 8.68073 33.8366 9.40867 33.3079 9.85253L29.4196 13.0207L31.0274 17.921C31.2484 18.5838 31.0235 19.3137 30.4711 19.7398C29.9168 20.1659 29.1553 20.1955 28.5694 19.8148L24.042 16.8656L19.5895 19.8444C19.3134 20.0298 18.9938 20.1225 18.6742 20.1225C18.327 20.1225 17.9798 20.0121 17.6878 19.7951C17.1296 19.3768 16.8968 18.6509 17.1059 17.9861L18.6525 13.0286L14.7445 9.84661ZM41.7827 6.89936C38.5198 6.89936 35.8645 9.55465 35.8645 12.8175V23.0441C35.3398 22.8587 34.7953 22.7206 34.2232 22.6891C32.6589 22.6062 31.132 23.1349 29.9365 24.2061L24.0006 29.6686C23.8368 29.5029 23.6849 29.3293 23.5133 29.1695L18.1001 24.1883C16.9224 23.1349 15.3896 22.6082 13.8331 22.6891C13.261 22.7206 12.7166 22.8587 12.1918 23.0441V12.8175C12.1918 9.55465 9.53654 6.89936 6.27365 6.89936C3.01076 6.89936 0.355469 9.55465 0.355469 12.8175V32.744C0.355469 36.9598 1.99678 40.923 4.97757 43.9038L8.82438 47.7506C9.20906 48.1353 9.71408 48.3286 10.2191 48.3286C10.7241 48.3286 11.2291 48.1353 11.6138 47.7506C12.3852 46.9792 12.3852 45.7305 11.6138 44.9611L7.767 41.1143C5.5319 38.8792 4.30092 35.9063 4.30092 32.744V12.8175C4.30092 11.7306 5.1847 10.8448 6.27365 10.8448C7.36259 10.8448 8.24637 11.7306 8.24637 12.8175C8.24637 12.8175 8.23651 28.7493 8.24637 28.8282C8.30555 30.1203 8.8086 31.4105 9.71803 32.4915L14.8787 37.8593C15.6342 38.6425 16.881 38.6701 17.6681 37.9126C18.4513 37.157 18.4769 35.9083 17.7214 35.1231L12.6495 29.856C12.0261 29.1123 12.0439 28.0056 12.6929 27.2816C13.0421 26.891 13.5234 26.6602 14.0482 26.6306C14.567 26.5951 15.0759 26.7785 15.4488 27.1119L20.8403 32.0753C22.8643 33.9375 24.0262 36.5849 24.0262 39.3349V46.3559C24.0262 47.4448 24.908 48.3286 25.9989 48.3286C27.0898 48.3286 27.9717 47.4448 27.9717 46.3559V39.3349C27.9717 37.0623 27.3917 34.847 26.3461 32.8723L32.5859 27.1297C32.9765 26.7785 33.4815 26.5951 34.0062 26.6306C34.531 26.6602 35.0123 26.891 35.3615 27.2816C35.6771 27.6327 35.8369 28.0746 35.8645 28.5106V28.5993C35.8645 28.5993 35.8645 28.6013 35.8645 28.6033C35.8705 29.0314 35.7501 29.4456 35.4937 29.7554L30.4967 34.9515C29.7412 35.7367 29.7668 36.9854 30.55 37.741C30.9327 38.1099 31.4239 38.2913 31.9171 38.2913C32.4359 38.2913 32.9508 38.0882 33.3394 37.6857L38.4251 32.3889C39.3129 31.3316 39.7784 30.0315 39.808 28.7256C39.812 28.6802 39.808 12.8156 39.808 12.8156C39.808 11.7286 40.6918 10.8428 41.7807 10.8428C42.8697 10.8428 43.7535 11.7286 43.7535 12.8156V32.7421C43.7535 35.9044 42.5225 38.8753 40.2874 41.1123L36.4406 44.9592C35.6692 45.7285 35.6692 46.9773 36.4406 47.7486C36.8253 48.1333 37.3303 48.3266 37.8353 48.3266C38.3403 48.3266 38.8453 48.1333 39.23 47.7486L43.0768 43.9018C46.0576 40.921 47.6989 36.9578 47.6989 32.7421V12.8175C47.6989 9.55465 45.0456 6.89936 41.7827 6.89936Z"
                  fill="white"
                />
              </g>
              <defs>
                <clipPath id="clip0_309_277">
                  <rect
                    width="47.3454"
                    height="47.3454"
                    fill="white"
                    transform="translate(0.355469 0.981445)"
                  />
                </clipPath>
              </defs>
            </svg>
          </div>
        </div>
        <div className="six-blocks">
          <div className="block-1">
            <p>
              Персональные условия
              <br /> для студентов
            </p>

            <div className="supblock-1">

            </div>
          </div>

          <div className="block-2">
            <p>
              Оперативное решение <br /> вопросов обучение
            </p>
            <div className="supblock-2"></div>
          </div>

          <div className="block-3">
            <p>
              Полностью прозрачное <br /> обучение
            </p>
            <div className="supblock-3"></div>
          </div>

          <div className="block-4">
            <p>
              Условия расположения <br />
              офиса и автодрома
            </p>
            <div className="supblock-4"></div>
          </div>

          <div className="block-5">
            <p>
              Опытные преподаватели <br />с большим стажем
            </p>
            <div className="supblock-5"></div>
          </div>

          <div className="block-6">
            <p>
              Обучнеие <br />в удобном для вас формате
            </p>
            <div className="supblock-6"></div>
          </div>
        </div>
      </div>

      <div className="why-we">
        <h1>Почему именно мы?</h1>
      </div>

      <div className="description-why-we">
        <p>
          Мы используем инновационные методики и актуальные программы, которые{" "}
          <br />
          помогут вам освоить вождение быстро и эффективно.{" "}
          <span className="bold-why-we">
            Никакой устаревшей теории <br /> — только то, что действительно
            пригодится на дороге.
          </span>
        </p>
      </div>

      <div className="special-blocks">
        <div className="studying-map">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="664"
            height="117"
            viewBox="0 0 664 117"
            fill="none"
          >
            <path
              d="M21.7577 76.2901L17.2804 85.2704L18.0494 115.03L2.8235 115.423L0.320026 18.5316L15.5459 18.1382L16.6367 60.3553L35.7548 17.616L50.7038 17.2298L30.6418 60.963L53.2073 114.122L37.5662 114.526L21.7577 76.2901ZM103.738 112.816L88.3738 113.213L85.2897 95.702L66.6034 96.1848L64.4277 113.832L50.4476 114.193L63.4468 16.9005L85.7319 16.3247L103.738 112.816ZM68.2015 82.9851L82.8737 82.606L74.2715 33.796L68.2015 82.9851ZM125.08 15.308C132.739 15.1102 138.467 16.9936 142.263 20.9585C146.151 24.921 148.197 30.824 148.399 38.6677L148.725 51.2636C148.927 59.1072 147.189 65.108 143.511 69.266C139.925 73.4216 134.302 75.5984 126.643 75.7963L119.445 75.9822L120.386 112.386L105.16 112.779L102.657 15.8874L125.08 15.308ZM118.24 29.3357L119.088 62.1405L126.285 61.9546C128.685 61.8926 130.514 61.1989 131.772 59.8737C133.031 58.5484 133.614 56.1325 133.524 52.6259L133.148 38.0921C133.058 34.5856 132.35 32.203 131.025 30.9445C129.699 29.686 127.837 29.0878 125.438 29.1497L118.24 29.3357ZM145.009 14.7931L192.071 13.5772L192.428 27.4189L176.51 27.8301L178.656 110.88L163.43 111.274L161.285 28.2235L145.367 28.6348L145.009 14.7931ZM245.145 109.162L229.781 109.559L226.697 92.0484L208.01 92.5312L205.835 110.178L191.855 110.539L204.854 13.2469L227.139 12.6711L245.145 109.162ZM209.608 79.3315L224.281 78.9524L215.678 30.1423L209.608 79.3315ZM275.789 86.0706C275.879 89.5772 276.636 92.0508 278.058 93.4915C279.57 94.8375 281.526 95.4795 283.925 95.4175C286.325 95.3555 288.198 94.6146 289.547 93.1946C290.985 91.68 291.659 89.1695 291.568 85.6629L290.216 33.3413C290.126 29.8347 289.324 27.4084 287.812 26.0624C286.39 24.6217 284.479 23.9324 282.08 23.9944C279.681 24.0564 277.762 24.8447 276.324 26.3593C274.975 27.7792 274.346 30.2424 274.437 33.749L275.789 86.0706ZM259.236 35.1113C259.033 27.2677 260.862 21.2184 264.723 16.9633C268.581 12.616 274.248 10.3458 281.722 10.1527C289.197 9.95956 294.973 11.9341 299.05 16.0764C303.126 20.1264 305.265 26.0732 305.467 33.9168L306.769 84.3006C306.972 92.1442 305.144 98.2397 301.286 102.587C297.425 106.842 291.757 109.066 284.283 109.259C276.808 109.452 271.034 107.524 266.958 103.474C262.881 99.3317 260.741 93.3387 260.538 85.4951L259.236 35.1113ZM325.124 46.5673L332.321 46.3813C339.981 46.1835 345.708 48.0669 349.504 52.0318C353.392 55.9943 355.438 61.8973 355.641 69.7409L355.966 82.3369C356.169 90.1805 354.431 96.1813 350.752 100.339C347.166 104.495 341.543 106.672 333.884 106.87L311.461 107.449L308.957 10.5571L349.237 9.51633L349.594 23.358L324.541 24.0054L325.124 46.5673ZM333.527 93.0279C335.926 92.9659 337.755 92.2722 339.013 90.947C340.272 89.6217 340.856 87.2058 340.765 83.6992L340.39 69.1654C340.299 65.6589 339.591 63.2763 338.266 62.0178C336.941 60.7593 335.078 60.161 332.679 60.223L325.481 60.409L326.329 93.2138L333.527 93.0279ZM363.788 92.246C364.621 92.3168 365.499 92.3403 366.422 92.3164C367.344 92.2926 368.221 92.2699 369.052 92.2485C370.251 92.2175 371.355 92.0505 372.363 91.7474C373.463 91.4419 374.373 90.9106 375.092 90.1533C375.903 89.3936 376.476 88.3169 376.809 86.9232C377.235 85.5271 377.42 83.7679 377.365 81.6455L353.337 9.41038L368.563 9.01698L386.778 65.3352L399.153 8.22659L414.379 7.83319L396.293 79.7713C394.711 86.4606 393.044 91.6286 391.291 95.2751C389.629 98.827 387.802 101.413 385.813 103.035C383.821 104.564 381.628 105.451 379.233 105.698C376.931 105.942 374.35 106.101 371.489 106.175C370.105 106.211 368.859 106.243 367.752 106.272C366.644 106.3 365.442 106.239 364.146 106.088L363.788 92.246ZM427.52 7.49366L428.486 44.8662C428.576 48.3728 429.332 50.8003 430.752 52.1487C432.264 53.4947 434.219 54.1367 436.619 54.0747C438.926 54.0151 440.756 53.3676 442.109 52.1323C443.46 50.8046 444.188 48.6158 444.294 45.5659L443.3 7.08595L458.525 6.69255L461.029 103.584L445.803 103.978L444.841 66.7437C443.561 67.2384 442.231 67.596 440.852 67.8163C439.562 67.9419 438.133 68.025 436.565 68.0656C429.09 68.2587 423.361 66.3291 419.378 62.2767C415.485 58.1297 413.437 52.1343 413.235 44.2907L412.294 7.88706L427.52 7.49366ZM480.298 46.9903L501.199 46.4502L501.556 60.2919L480.655 60.832L481.388 89.2074L507.688 88.5279L508.045 102.37L466.52 103.443L464.017 6.55066L505.542 5.47775L505.899 19.3194L479.6 19.999L480.298 46.9903ZM526.764 101.886L511.538 102.279L509.035 5.3875L524.261 4.9941L525.333 46.5192L542.636 46.0721L541.563 4.54705L557.065 4.14649L559.569 101.038L544.066 101.439L542.993 59.9138L525.691 60.3609L526.764 101.886ZM580.713 100.492L565.072 100.896L562.569 4.0043L576.133 3.65381L577.632 61.6505L591.774 3.24968L610.876 2.75614L613.38 99.648L599.676 100.002L597.863 29.8247L580.713 100.492ZM638.739 15.8872C636.063 15.9563 634.099 16.7919 632.848 18.394C631.688 19.9938 631.154 22.5469 631.245 26.0535L631.492 35.6042C631.592 39.4799 632.445 42.1357 634.052 43.5716C635.751 45.0051 638.031 45.685 640.892 45.611L646.844 45.4573L646.075 15.6976L638.739 15.8872ZM616.108 99.5775C616.798 97.7129 617.213 95.9015 617.353 94.1435C617.489 92.2932 617.527 90.1684 617.465 87.7691L617.079 72.8201C616.947 67.7448 617.529 63.436 618.822 59.8937C620.206 56.2567 622.815 53.6038 626.65 51.9349C619.925 48.9691 616.434 42.5032 616.176 32.5372L615.98 24.9243C615.786 17.4498 617.395 11.8217 620.807 8.03993C624.31 4.25582 630.03 2.26125 637.966 2.0562L660.943 1.46252L663.446 98.3544L648.221 98.7478L647.201 59.299L641.941 59.4349C638.435 59.5255 635.921 60.5138 634.4 62.3999C632.879 64.286 632.177 67.4898 632.294 72.0115L632.687 87.2373C632.737 89.1752 632.733 90.7912 632.674 92.0855C632.707 93.3774 632.642 94.441 632.479 95.2762C632.408 96.1091 632.288 96.8048 632.118 97.3632C631.947 97.9217 631.778 98.5262 631.611 99.177L616.108 99.5775Z"
              fill="url(#paint0_linear_321_3)"
              fill-opacity="0.3"
            />
            <defs>
              <linearGradient
                id="paint0_linear_321_3"
                x1="502.097"
                y1="318.747"
                x2="444.312"
                y2="-65.9235"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="white" />
                <stop offset="1" stop-color="#999999" stop-opacity="0.17" />
              </linearGradient>
            </defs>
          </svg>
        </div>

        <div className="white-special-blocks">
          <div className="spec-block-1">
            <svg
              width="233"
              height="169"
              viewBox="0 0 233 169"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g filter="url(#filter0_d_309_116)">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M27.9521 10.6875C15.8089 10.6875 5.96484 20.5315 5.96484 32.6748V136.614C5.96484 148.758 15.8089 158.602 27.9521 158.602H195.855C207.998 158.602 217.842 148.758 217.842 136.614V101.628C217.676 101.632 217.509 101.635 217.342 101.635C207.683 101.635 199.853 93.8043 199.853 84.1449C199.853 74.4855 207.683 66.6551 217.342 66.6551C217.509 66.6551 217.676 66.6574 217.842 66.6621V32.6747C217.842 20.5315 207.998 10.6875 195.855 10.6875H27.9521Z"
                  fill="url(#paint0_linear_309_116)"
                />
              </g>
              <defs>
                <filter
                  id="filter0_d_309_116"
                  x="0.967742"
                  y="0.693297"
                  width="231.865"
                  height="167.903"
                  filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB"
                >
                  <feFlood flood-opacity="0" result="BackgroundImageFix" />
                  <feColorMatrix
                    in="SourceAlpha"
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                    result="hardAlpha"
                  />
                  <feOffset dx="4.9971" />
                  <feGaussianBlur stdDeviation="4.9971" />
                  <feComposite in2="hardAlpha" operator="out" />
                  <feColorMatrix
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"
                  />
                  <feBlend
                    mode="normal"
                    in2="BackgroundImageFix"
                    result="effect1_dropShadow_309_116"
                  />
                  <feBlend
                    mode="normal"
                    in="SourceGraphic"
                    in2="effect1_dropShadow_309_116"
                    result="shape"
                  />
                </filter>
                <linearGradient
                  id="paint0_linear_309_116"
                  x1="129.893"
                  y1="22.6805"
                  x2="235.832"
                  y2="383.471"
                  gradientUnits="userSpaceOnUse"
                >
                  <stop stop-color="#F0F0F0" />
                  <stop offset="1" stop-color="#7E7E7E" />
                </linearGradient>
              </defs>
            </svg>
            <span className="conversation">Знакомство</span>
            <p>После того как вы оставите <br />
              заявку или позвоните нам - <br />
              мы назначим вам личную<br />
              встречу</p>
            <div className="green-1">
              <span>#01</span>
            </div>
          </div>

          <div className="spec-block-2">
            <svg
              width="307"
              height="169"
              viewBox="0 0 307 169"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g filter="url(#filter0_d_309_117)">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M27.873 10.6876C15.7298 10.6876 5.88574 20.5317 5.88574 32.6749V136.615C5.88574 148.758 15.7298 158.602 27.873 158.602H269.733C281.876 158.602 291.72 148.758 291.72 136.615V101.628C291.554 101.633 291.387 101.635 291.22 101.635C281.561 101.635 273.73 93.8044 273.73 84.145C273.73 74.4856 281.561 66.6552 291.22 66.6552C291.387 66.6552 291.554 66.6575 291.72 66.6622V32.6749C291.72 20.5316 281.876 10.6876 269.733 10.6876H27.873Z"
                  fill="url(#paint0_linear_309_117)"
                />
              </g>
              <defs>
                <filter
                  id="filter0_d_309_117"
                  x="0.888641"
                  y="0.693419"
                  width="305.822"
                  height="167.903"
                  filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB"
                >
                  <feFlood flood-opacity="0" result="BackgroundImageFix" />
                  <feColorMatrix
                    in="SourceAlpha"
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                    result="hardAlpha"
                  />
                  <feOffset dx="4.9971" />
                  <feGaussianBlur stdDeviation="4.9971" />
                  <feComposite in2="hardAlpha" operator="out" />
                  <feColorMatrix
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"
                  />
                  <feBlend
                    mode="normal"
                    in2="BackgroundImageFix"
                    result="effect1_dropShadow_309_117"
                  />
                  <feBlend
                    mode="normal"
                    in="SourceGraphic"
                    in2="effect1_dropShadow_309_117"
                    result="shape"
                  />
                </filter>
                <linearGradient
                  id="paint0_linear_309_117"
                  x1="173.072"
                  y1="22.6807"
                  x2="254.512"
                  y2="396.852"
                  gradientUnits="userSpaceOnUse"
                >
                  <stop stop-color="#F0F0F0" />
                  <stop offset="1" stop-color="#7E7E7E" />
                </linearGradient>
              </defs>
            </svg>
            <span className="dealing">Заключение<br />
            договора</span>
            <p>Вы выбираете формат обучения мы заключаем договор</p>
            <div className="green-2">
              <span>#02</span>
            </div>
          </div>

          <div className="spec-block-3">
            <svg
              width="351"
              height="169"
              viewBox="0 0 351 169"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g filter="url(#filter0_d_309_120)">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M27.2753 10.6875C15.1321 10.6875 5.28809 20.5315 5.28809 32.6748V136.614C5.28809 148.758 15.1321 158.602 27.2753 158.602H313.609C325.752 158.602 335.596 148.758 335.596 136.614V101.628C335.43 101.632 335.264 101.635 335.097 101.635C325.437 101.635 317.607 93.8043 317.607 84.1449C317.607 74.4855 325.437 66.6551 335.097 66.6551C335.264 66.6551 335.43 66.6574 335.596 66.6621V32.6747C335.596 20.5315 325.752 10.6875 313.609 10.6875H27.2753Z"
                  fill="url(#paint0_linear_309_120)"
                />
              </g>
              <defs>
                <filter
                  id="filter0_d_309_120"
                  x="0.290985"
                  y="0.693297"
                  width="350.297"
                  height="167.903"
                  filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB"
                >
                  <feFlood flood-opacity="0" result="BackgroundImageFix" />
                  <feColorMatrix
                    in="SourceAlpha"
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                    result="hardAlpha"
                  />
                  <feOffset dx="4.9971" />
                  <feGaussianBlur stdDeviation="4.9971" />
                  <feComposite in2="hardAlpha" operator="out" />
                  <feColorMatrix
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"
                  />
                  <feBlend
                    mode="normal"
                    in2="BackgroundImageFix"
                    result="effect1_dropShadow_309_120"
                  />
                  <feBlend
                    mode="normal"
                    in="SourceGraphic"
                    in2="effect1_dropShadow_309_120"
                    result="shape"
                  />
                </filter>
                <linearGradient
                  id="paint0_linear_309_120"
                  x1="198.487"
                  y1="22.6805"
                  x2="269.772"
                  y2="401.152"
                  gradientUnits="userSpaceOnUse"
                >
                  <stop stop-color="#F0F0F0" />
                  <stop offset="1" stop-color="#7E7E7E" />
                </linearGradient>
              </defs>
            </svg>
            <span className="studying-wb">Обучение</span>
            <p>После того как вы оставите <br /> заявку или позвоните нам - <br /> мы назначим вам личную <br /> встречу</p>
            <div className="green-3">
              <span>#03</span>
            </div>
          </div>

          <div className="spec-block-4">
            <svg
              width="339"
              height="169"
              viewBox="0 0 339 169"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g filter="url(#filter0_d_309_123)">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M27.6445 10.6876C15.5013 10.6876 5.65723 20.5317 5.65723 32.6749V136.615C5.65723 148.758 15.5013 158.602 27.6445 158.602H301.486C313.629 158.602 323.473 148.758 323.473 136.615V101.628C323.307 101.633 323.14 101.635 322.973 101.635C313.314 101.635 305.483 93.8044 305.483 84.145C305.483 74.4856 313.314 66.6552 322.973 66.6552C323.14 66.6552 323.307 66.6575 323.473 66.6622V32.6749C323.473 20.5316 313.629 10.6876 301.486 10.6876H27.6445Z"
                  fill="url(#paint0_linear_309_123)"
                />
              </g>
              <defs>
                <filter
                  id="filter0_d_309_123"
                  x="0.660125"
                  y="0.693419"
                  width="337.804"
                  height="167.903"
                  filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB"
                >
                  <feFlood flood-opacity="0" result="BackgroundImageFix" />
                  <feColorMatrix
                    in="SourceAlpha"
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                    result="hardAlpha"
                  />
                  <feOffset dx="4.9971" />
                  <feGaussianBlur stdDeviation="4.9971" />
                  <feComposite in2="hardAlpha" operator="out" />
                  <feColorMatrix
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"
                  />
                  <feBlend
                    mode="normal"
                    in2="BackgroundImageFix"
                    result="effect1_dropShadow_309_123"
                  />
                  <feBlend
                    mode="normal"
                    in="SourceGraphic"
                    in2="effect1_dropShadow_309_123"
                    result="shape"
                  />
                </filter>
                <linearGradient
                  id="paint0_linear_309_123"
                  x1="191.549"
                  y1="22.6807"
                  x2="265.433"
                  y2="400.115"
                  gradientUnits="userSpaceOnUse"
                >
                  <stop stop-color="#F0F0F0" />
                  <stop offset="1" stop-color="#7E7E7E" />
                </linearGradient>
              </defs>
            </svg>
            <span className="auto-exam">Экзамен <br />в Автошколе</span>
            <p>После того как вы оставите <br /> заявку или позвоните нам - <br /> мы назначим вам личную <br /> встречу</p>
            <div className="green-4">
              <span>#04</span>
            </div>
          </div>

          <div className="spec-block-5">
            <svg
              width="349"
              height="169"
              viewBox="0 0 349 169"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <g filter="url(#filter0_d_309_126)">
                <path
                  fill-rule="evenodd"
                  clip-rule="evenodd"
                  d="M27.5273 10.6876C15.3841 10.6876 5.54004 20.5317 5.54004 32.6749V136.615C5.54004 148.758 15.3841 158.602 27.5273 158.602H311.363C323.506 158.602 333.35 148.758 333.35 136.615V101.628C333.184 101.633 333.017 101.635 332.85 101.635C323.191 101.635 315.36 93.8044 315.36 84.145C315.36 74.4856 323.191 66.6552 332.85 66.6552C333.017 66.6552 333.184 66.6575 333.35 66.6622V32.6749C333.35 20.5316 323.506 10.6876 311.363 10.6876H27.5273Z"
                  fill="url(#paint0_linear_309_126)"
                />
              </g>
              <defs>
                <filter
                  id="filter0_d_309_126"
                  x="0.542938"
                  y="0.693419"
                  width="347.798"
                  height="167.903"
                  filterUnits="userSpaceOnUse"
                  color-interpolation-filters="sRGB"
                >
                  <feFlood flood-opacity="0" result="BackgroundImageFix" />
                  <feColorMatrix
                    in="SourceAlpha"
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                    result="hardAlpha"
                  />
                  <feOffset dx="4.9971" />
                  <feGaussianBlur stdDeviation="4.9971" />
                  <feComposite in2="hardAlpha" operator="out" />
                  <feColorMatrix
                    type="matrix"
                    values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.25 0"
                  />
                  <feBlend
                    mode="normal"
                    in2="BackgroundImageFix"
                    result="effect1_dropShadow_309_126"
                  />
                  <feBlend
                    mode="normal"
                    in="SourceGraphic"
                    in2="effect1_dropShadow_309_126"
                    result="shape"
                  />
                </filter>
                <linearGradient
                  id="paint0_linear_309_126"
                  x1="197.278"
                  y1="22.6807"
                  x2="269.068"
                  y2="400.953"
                  gradientUnits="userSpaceOnUse"
                >
                  <stop stop-color="#F0F0F0" />
                  <stop offset="1" stop-color="#7E7E7E" />
                </linearGradient>
              </defs>
            </svg>
            <span className="auto-gai-exam">Экзамен <br />в ГАИ</span>
            <p>После того как вы оставите <br /> заявку или позвоните нам - <br /> мы назначим вам личную <br /> встречу</p>
            <div className="green-5">
              <span>#05</span>
            </div>
          </div>

          <div className="spec-block-6">
            <svg
              width="356"
              height="149"
              viewBox="0 0 356 149"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fill-rule="evenodd"
                clip-rule="evenodd"
                d="M22.9199 0.687622C10.7766 0.687622 0.932617 10.5317 0.932617 22.6749V126.615C0.932617 138.758 10.7766 148.602 22.9198 148.602H333.24C345.383 148.602 355.227 138.758 355.227 126.615V91.6279C355.061 91.6325 354.895 91.6349 354.727 91.6349C345.068 91.6349 337.238 83.8044 337.238 74.145C337.238 64.4856 345.068 56.6552 354.727 56.6552C354.895 56.6552 355.061 56.6575 355.227 56.6622V22.6749C355.227 10.5316 345.383 0.687622 333.24 0.687622H22.9199Z"
                fill="url(#paint0_linear_309_129)"
              />
              <defs>
                <linearGradient
                  id="paint0_linear_309_129"
                  x1="208.161"
                  y1="12.6807"
                  x2="274.919"
                  y2="392.856"
                  gradientUnits="userSpaceOnUse"
                >
                  <stop stop-color="#F0F0F0" />
                  <stop offset="1" stop-color="#7E7E7E" />
                </linearGradient>
              </defs>
            </svg>
            <span className="giving-prava">Выдача в.у.</span>
            <p>После того как вы оставите <br /> заявку или позвоните нам - <br /> мы назначим вам личную <br /> встречу</p>
            <div className="green-6">
              <span>#06</span>
            </div>
          </div>
        </div>
      </div>

      <div className="map-bg">
        <div className="element-of-map">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            width="596"
            height="390"
            viewBox="0 0 596 390"
            fill="none"
          >
            <rect
              x="-1.95984"
              y="58.6116"
              width="566.761"
              height="335.805"
              rx="36.9785"
              transform="rotate(-6.21103 -1.95984 58.6116)"
              stroke="url(#paint0_linear_318_660)"
              stroke-width="1.99884"
            />
            <defs>
              <linearGradient
                id="paint0_linear_318_660"
                x1="329.61"
                y1="85.1157"
                x2="540.058"
                y2="927.553"
                gradientUnits="userSpaceOnUse"
              >
                <stop stop-color="#4F4F4F" />
                <stop offset="1" stop-color="#7E7E7E" />
              </linearGradient>
            </defs>
          </svg>
        </div>
      </div>
    </>
  );
}

export default sosal;