import './ProgramLearning.css'

import MKPP from "../../assets/img/mkpp-img.png"
import AKPP from "../../assets/img/akpp-img.png"

function ProgramLearning(){
    return (
        <>
            <div className="ProgramLearning" id='learning'>
                <div className="title-pl">
                    <h1>практические <br />программы обучения</h1>
                </div>
                <div className="cards-pl">
                <div className="card" id='akpp'>
                    <img src={AKPP} alt="" />
                    <div className="card-content">
                    <div className="card-top-txt">
                    <div className="title-cards">
                        <h1>АКПП</h1>
                    </div>
                    <div className="card-descr">
                        <p>автоматическая коробка <br /> переключения передач</p>
                    </div>
                    </div>
                    <div className="text-cards">
                        <p> <span>Полный контроль: </span>Возможность <br /> самостоятельно выбирать передачу и <br />режим движения. </p>
                        <p> <span>Универсальность: </span>Умение управлять <br /> любым типом автомобиля. </p>
                        <p> <span>Экономия топлива: </span>При правильном  <br /> использовании МКПП может быть <br /> более экономичной. </p>
                        <p> <span>Навык вождения: </span>Лучшее понимание  <br /> работы автомобиля и улучшение <br />  координации. </p>
                    </div>
                    <button>
                            <svg width="23" height="22" viewBox="0 0 23 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M14.2907 12.7548L16.7569 15.2011L16.0011 15.9569L13.5349 13.4907C13.4355 13.3713 13.2764 13.3117 13.1173 13.3117H13.0974C12.9184 13.3316 12.7593 13.4111 12.6598 13.5503L11.5461 15.0022L10.4124 9.61237L15.8023 10.746L14.3504 11.8598C14.2112 11.9592 14.1316 12.1183 14.1117 12.2973C14.1117 12.4565 14.1714 12.6355 14.2907 12.7548ZM22.7633 11.0245C22.7633 17.0706 17.8707 21.9632 11.8245 21.9632C5.77836 21.9632 0.885742 17.0706 0.885742 11.0245C0.885742 4.97831 5.77836 0.0856934 11.8245 0.0856934C17.8707 0.0856934 22.7633 4.97831 22.7633 11.0245ZM11.8046 7.02684L12.64 7.86217L14.4299 6.07219L13.5946 5.23686L11.8046 7.02684ZM9.63676 6.84785H10.8301V4.66009H9.63676V6.84785ZM5.46014 10.03H7.64789V8.83671H5.46014V10.03ZM8.66222 11.8399L7.82689 11.0046L6.03691 12.7946L6.87223 13.6299L8.66222 11.8399ZM8.66222 7.02684L6.87223 5.23686L6.03691 6.07219L7.82689 7.86217L8.66222 7.02684ZM18.0099 14.7834L15.6233 12.3968L17.5525 10.9051C17.7315 10.7659 17.8309 10.5273 17.7712 10.3085C17.7116 10.0698 17.5326 9.89081 17.3138 9.85104L9.75609 8.25994C9.55721 8.22016 9.35832 8.27983 9.2191 8.41905C9.07988 8.55827 9.02021 8.75716 9.05999 8.95605L10.6511 16.5137C10.7108 16.7325 10.8897 16.9115 11.1085 16.9712C11.3273 17.0308 11.566 16.9314 11.7052 16.7524L13.1968 14.8232L15.5835 17.2098C15.7028 17.3292 15.842 17.3888 16.0011 17.3888C16.1602 17.3888 16.2995 17.3292 16.4188 17.2098L18.0099 15.6188C18.2486 15.4 18.2486 15.0221 18.0099 14.7834Z" fill="white" />
                            </svg>
                            Записаться
                    </button>
                    </div>
                    
                    </div>
                    <div className="card">
                    <div className="card-content">
                    <div className="card-top-txt">
                    <div className="title-cards">
                        <h1>МКПП</h1>
                    </div>
                    <div className="card-descr">
                        <p>механическая коробка <br /> переключения передач</p>
                    </div>
                    </div>
                    <div className="text-cards">
                        <p> <span>Полный контроль: </span>Возможность <br /> самостоятельно выбирать передачу и <br />режим движения. </p>
                        <p> <span>Универсальность: </span>Умение управлять <br /> любым типом автомобиля. </p>
                        <p> <span>Экономия топлива: </span>При правильном  <br /> использовании МКПП может быть <br /> более экономичной. </p>
                        <p> <span>Навык вождения: </span>Лучшее понимание  <br /> работы автомобиля и улучшение <br />  координации. </p>
                    </div>
                    <button>
                            <svg width="23" height="22" viewBox="0 0 23 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M14.2907 12.7548L16.7569 15.2011L16.0011 15.9569L13.5349 13.4907C13.4355 13.3713 13.2764 13.3117 13.1173 13.3117H13.0974C12.9184 13.3316 12.7593 13.4111 12.6598 13.5503L11.5461 15.0022L10.4124 9.61237L15.8023 10.746L14.3504 11.8598C14.2112 11.9592 14.1316 12.1183 14.1117 12.2973C14.1117 12.4565 14.1714 12.6355 14.2907 12.7548ZM22.7633 11.0245C22.7633 17.0706 17.8707 21.9632 11.8245 21.9632C5.77836 21.9632 0.885742 17.0706 0.885742 11.0245C0.885742 4.97831 5.77836 0.0856934 11.8245 0.0856934C17.8707 0.0856934 22.7633 4.97831 22.7633 11.0245ZM11.8046 7.02684L12.64 7.86217L14.4299 6.07219L13.5946 5.23686L11.8046 7.02684ZM9.63676 6.84785H10.8301V4.66009H9.63676V6.84785ZM5.46014 10.03H7.64789V8.83671H5.46014V10.03ZM8.66222 11.8399L7.82689 11.0046L6.03691 12.7946L6.87223 13.6299L8.66222 11.8399ZM8.66222 7.02684L6.87223 5.23686L6.03691 6.07219L7.82689 7.86217L8.66222 7.02684ZM18.0099 14.7834L15.6233 12.3968L17.5525 10.9051C17.7315 10.7659 17.8309 10.5273 17.7712 10.3085C17.7116 10.0698 17.5326 9.89081 17.3138 9.85104L9.75609 8.25994C9.55721 8.22016 9.35832 8.27983 9.2191 8.41905C9.07988 8.55827 9.02021 8.75716 9.05999 8.95605L10.6511 16.5137C10.7108 16.7325 10.8897 16.9115 11.1085 16.9712C11.3273 17.0308 11.566 16.9314 11.7052 16.7524L13.1968 14.8232L15.5835 17.2098C15.7028 17.3292 15.842 17.3888 16.0011 17.3888C16.1602 17.3888 16.2995 17.3292 16.4188 17.2098L18.0099 15.6188C18.2486 15.4 18.2486 15.0221 18.0099 14.7834Z" fill="white" />
                            </svg>
                            Записаться
                    </button>
                    </div>
                    <img src={MKPP} alt="" />
                    </div>
                    
                    
                </div>
            </div>
        </>
    )
}

export default ProgramLearning;